results/ycsb/read-heavy/tracing_ycsb_postgresql-13-native-read-heavy_1_BnfYkNnF/0_load.txt
bin/ycsb load jdbc -s -jvm-args=-XX:MaxRAMPercentage=85.0  -p  db.user=benchant -p  db.passwd=benchANT2022 -p  db.driver=org.postgresql.Driver -p  db.batchsize=1000  -p  jdbc.batchupdateapi=true  -p db.url=jdbc:postgresql://172.31.20.157:5432/benchdb?sslmode=allow -p workload=site.ycsb.workloads.CoreWorkload -threads 50 -p recordcount=2000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.9 -p updateproportion=0.0 -p insertproportion=0.1 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3
/usr/java/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/jdbc-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/core-0.17.0.jar:/binary/ycsb/jdbc-binding/lib/geronimo-jta_1.1_spec-1.1.1.jar:/binary/ycsb/jdbc-binding/lib/commons-pool-1.5.4.jar:/binary/ycsb/jdbc-binding/lib/commons-lang-2.4.jar:/binary/ycsb/jdbc-binding/lib/crate-jdbc-standalone-2.6.0.jar:/binary/ycsb/jdbc-binding/lib/serp-1.13.1.jar:/binary/ycsb/jdbc-binding/lib/openjpa-jdbc-2.1.1.jar:/binary/ycsb/jdbc-binding/lib/openjpa-kernel-2.1.1.jar:/binary/ycsb/jdbc-binding/lib/postgresql-42.2.5.jar:/binary/ycsb/jdbc-binding/lib/jdbc-binding-0.17.0.jar:/binary/ycsb/jdbc-binding/lib/openjpa-lib-2.1.1.jar:/binary/ycsb/jdbc-binding/lib/mariadb-java-client-3.0.5.jar:/binary/ycsb/jdbc-binding/lib/commons-collections-3.2.1.jar:/binary/ycsb/jdbc-binding/lib/geronimo-jms_1.1_spec-1.1.1.jar:/binary/ycsb/jdbc-binding/lib/mysql-connector-java-5.1.47.jar:/binary/ycsb/jdbc-binding/lib/mysql-connector-java-5.1.47/mysql-connector-java-5.1.47-bin.jar:/binary/ycsb/jdbc-binding/lib/mysql-connector-java-5.1.47/src/lib/jboss-common-jdbc-wrapper.jar:/binary/ycsb/jdbc-binding/lib/mysql-connector-java-5.1.47/src/lib/c3p0-0.9.1-pre6.jar:/binary/ycsb/jdbc-binding/lib/mysql-connector-java-5.1.47/src/lib/jboss-common-jdbc-wrapper-src.jar:/binary/ycsb/jdbc-binding/lib/mysql-connector-java-5.1.47/src/lib/slf4j-api-1.6.1.jar site.ycsb.Client -db site.ycsb.db.JdbcDBClient -s -p db.user=benchant -p db.passwd=benchANT2022 -p db.driver=org.postgresql.Driver -p db.batchsize=1000 -p jdbc.batchupdateapi=true -p db.url=jdbc:postgresql://172.31.20.157:5432/benchdb?sslmode=allow -p workload=site.ycsb.workloads.CoreWorkload -threads 50 -p recordcount=2000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.9 -p updateproportion=0.0 -p insertproportion=0.1 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
Command line: -db site.ycsb.db.JdbcDBClient -s -p db.user=benchant -p db.passwd=benchANT2022 -p db.driver=org.postgresql.Driver -p db.batchsize=1000 -p jdbc.batchupdateapi=true -p db.url=jdbc:postgresql://172.31.20.157:5432/benchdb?sslmode=allow -p workload=site.ycsb.workloads.CoreWorkload -threads 50 -p recordcount=2000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.9 -p updateproportion=0.0 -p insertproportion=0.1 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
Adding shard node URL: jdbc:postgresql://172.31.20.157:5432/benchdb?sslmode=allow
Adding shard node URL: jdbc:postgresql://172.31.20.157:5432/benchdb?sslmode=allow2023-01-17 18:42:10:722 0 sec: 0 operations; est completion in 0 second 

Adding shard node URL: jdbc:postgresql://172.31.20.157:5432/benchdb?sslmode=allow
Adding shard node URL: jdbc:postgresql://172.31.20.157:5432/benchdb?sslmode=allow
Adding shard node URL: jdbc:postgresql://172.31.20.157:5432/benchdb?sslmode=allow
[...]
Using shards: 1, batchSize:1000, fetchSize: -1
Using shards: 1, batchSize:1000, fetchSize: -1
Using shards: 1, batchSize:1000, fetchSize: -1
[...]
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 1, batchSize:1000, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 1, batchSize:1000, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 1, batchSize:1000, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

Using shards: 1, batchSize:1000, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

Using shards: 1, batchSize:1000, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 1, batchSize:1000, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 1, batchSize:1000, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 1, batchSize:1000, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

Using shards: 1, batchSize:1000, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 1, batchSize:1000, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
Using shards: 1, batchSize:1000, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 1, batchSize:1000, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2023-01-17 18:42:20:706 10 sec: 49950 operations; 4995 current ops/sec; est completion in 6 minutes [INSERT: Count=49950, Max=125119, Min=13, Avg=294.99, 90=108, 99=4223, 99.9=75647, 99.99=106111] 
2023-01-17 18:42:30:706 20 sec: 99950 operations; 5000 current ops/sec; est completion in 6 minutes [INSERT: Count=50000, Max=19005439, Min=12, Avg=17241.59, 90=26, 99=37, 99.9=162815, 99.99=18038783] 
2023-01-17 18:42:40:706 30 sec: 99950 operations; 0 current ops/sec; est completion in 9 minutes [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=?, 90=0, 99=0, 99.9=0, 99.99=0] 
2023-01-17 18:42:50:706 40 sec: 99950 operations; 0 current ops/sec; est completion in 12 minutes [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=?, 90=0, 99=0, 99.9=0, 99.99=0] 
2023-01-17 18:43:00:706 50 sec: 148950 operations; 4900 current ops/sec; est completion in 10 minutes [INSERT: Count=49000, Max=32243711, Min=12, Avg=30340.28, 90=14, 99=22, 99.9=58847, 99.99=31260671] 
2023-01-17 18:43:10:706 60 sec: 149950 operations; 100 current ops/sec; est completion in 12 minutes [INSERT: Count=1000, Max=31703039, Min=12, Avg=31707.68, 90=13, 99=15, 99.9=45, 99.99=31703039] 
2023-01-17 18:43:20:706 70 sec: 149950 operations; 0 current ops/sec; est completion in 14 minutes [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=?, 90=0, 99=0, 99.9=0, 99.99=0] 
2023-01-17 18:43:30:706 80 sec: 199950 operations; 5000 current ops/sec; est completion in 12 minutes [INSERT: Count=50000, Max=27508735, Min=12, Avg=25190.73, 90=14, 99=23, 99.9=156159, 99.99=26148863] 
2023-01-17 18:43:40:706 90 sec: 199950 operations; 0 current ops/sec; est completion in 13 minutes [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=?, 90=0, 99=0, 99.9=0, 99.99=0] 
2023-01-17 18:43:50:706 100 sec: 245950 operations; 4600 current ops/sec; est completion in 11 minutes [INSERT: Count=46000, Max=24444927, Min=12, Avg=20356.82, 90=14, 99=19, 99.9=45375, 99.99=21299199] 
2023-01-17 18:44:00:708 110 sec: 249950 operations; 399.92 current ops/sec; est completion in 12 minutes [INSERT: Count=4000, Max=26165247, Min=12, Avg=25285.25, 90=14, 99=18, 99.9=49, 99.99=26165247] 
2023-01-17 18:44:10:706 120 sec: 298950 operations; 4900.98 current ops/sec; est completion in 11 minutes [INSERT: Count=49000, Max=22691839, Min=12, Avg=20448.26, 90=14, 99=20, 99.9=90, 99.99=21577727] 
2023-01-17 18:44:20:706 130 sec: 300950 operations; 200 current ops/sec; est completion in 12 minutes [INSERT: Count=2000, Max=19546111, Min=12, Avg=18420.26, 90=13, 99=15, 99.9=36, 99.99=19546111] 
2023-01-17 18:44:30:706 140 sec: 349950 operations; 4900 current ops/sec; est completion in 11 minutes [INSERT: Count=49000, Max=19742719, Min=12, Avg=18465.59, 90=14, 99=16, 99.9=61, 99.99=19234815] 
2023-01-17 18:44:40:706 150 sec: 360950 operations; 1100 current ops/sec; est completion in 11 minutes [INSERT: Count=11000, Max=19103743, Min=12, Avg=18403.96, 90=14, 99=16, 99.9=44, 99.99=19070975] 
2023-01-17 18:44:50:706 160 sec: 399950 operations; 3900 current ops/sec; est completion in 10 minutes [INSERT: Count=39000, Max=21381119, Min=12, Avg=19540.41, 90=14, 99=20, 99.9=51, 99.99=20611071] 
2023-01-17 18:45:00:706 170 sec: 413950 operations; 1400 current ops/sec; est completion in 10 minutes [INSERT: Count=14000, Max=20611071, Min=12, Avg=19568.71, 90=14, 99=26, 99.9=128, 99.99=20348927] 
2023-01-17 18:45:10:706 180 sec: 449950 operations; 3600 current ops/sec; est completion in 10 minutes [INSERT: Count=36000, Max=20840447, Min=12, Avg=19102.25, 90=14, 99=25, 99.9=82, 99.99=20398079] 
2023-01-17 18:45:20:706 190 sec: 485950 operations; 3600 current ops/sec; est completion in 9 minutes [INSERT: Count=36000, Max=18595839, Min=12, Avg=17091.34, 90=14, 99=18, 99.9=66623, 99.99=18153471] 
2023-01-17 18:45:30:706 200 sec: 499950 operations; 1400 current ops/sec; est completion in 10 minutes [INSERT: Count=14000, Max=18808831, Min=12, Avg=17558.13, 90=14, 99=16, 99.9=63, 99.99=18153471] 
2023-01-17 18:45:40:706 210 sec: 547950 operations; 4800 current ops/sec; est completion in 9 minutes [INSERT: Count=48000, Max=19775487, Min=12, Avg=18053.78, 90=14, 99=21, 99.9=39903, 99.99=18825215] 
2023-01-17 18:45:50:706 220 sec: 550950 operations; 300 current ops/sec; est completion in 9 minutes [INSERT: Count=3000, Max=19169279, Min=12, Avg=18278.34, 90=14, 99=16, 99.9=41, 99.99=19169279] 
2023-01-17 18:46:00:706 230 sec: 598950 operations; 4800 current ops/sec; est completion in 8 minutes [INSERT: Count=48000, Max=19103743, Min=12, Avg=17608.22, 90=14, 99=21, 99.9=92, 99.99=18317311] 
2023-01-17 18:46:10:706 240 sec: 608950 operations; 1000 current ops/sec; est completion in 9 minutes [INSERT: Count=10000, Max=19693567, Min=12, Avg=17644.17, 90=14, 99=18, 99.9=40, 99.99=18333695] 
2023-01-17 18:46:20:706 250 sec: 649950 operations; 4100 current ops/sec; est completion in 8 minutes [INSERT: Count=41000, Max=20840447, Min=12, Avg=19112.43, 90=14, 99=23, 99.9=156, 99.99=20381695] 
2023-01-17 18:46:30:706 260 sec: 664950 operations; 1500 current ops/sec; est completion in 8 minutes [INSERT: Count=15000, Max=19841023, Min=12, Avg=18573.37, 90=14, 99=21, 99.9=46, 99.99=19464191] 
2023-01-17 18:46:40:706 270 sec: 699950 operations; 3500 current ops/sec; est completion in 8 minutes [INSERT: Count=35000, Max=19775487, Min=12, Avg=17607.96, 90=14, 99=18, 99.9=49, 99.99=19513343] 
2023-01-17 18:46:50:706 280 sec: 728950 operations; 2900 current ops/sec; est completion in 8 minutes [INSERT: Count=29000, Max=19021823, Min=12, Avg=17410.13, 90=14, 99=16, 99.9=52255, 99.99=18202623] 
2023-01-17 18:47:00:706 290 sec: 749950 operations; 2100 current ops/sec; est completion in 8 minutes [INSERT: Count=21000, Max=19447807, Min=12, Avg=18236.22, 90=14, 99=16, 99.9=48, 99.99=19152895] 
2023-01-17 18:47:10:706 300 sec: 797950 operations; 4800 current ops/sec; est completion in 7 minutes [INSERT: Count=48000, Max=18546687, Min=12, Avg=16832.46, 90=14, 99=18, 99.9=89, 99.99=17924095] 
2023-01-17 18:47:20:706 310 sec: 813950 operations; 1600 current ops/sec; est completion in 7 minutes [INSERT: Count=16000, Max=17776639, Min=12, Avg=15549.81, 90=14, 99=16, 99.9=47, 99.99=16162815] 
2023-01-17 18:47:30:706 320 sec: 849950 operations; 3600 current ops/sec; est completion in 7 minutes [INSERT: Count=36000, Max=17203199, Min=12, Avg=16003.93, 90=14, 99=24, 99.9=57, 99.99=16809983] 
2023-01-17 18:47:40:706 330 sec: 890314 operations; 4036.4 current ops/sec; est completion in 6 minutes [INSERT: Count=40380, Max=17678335, Min=12, Avg=16233.94, 90=14, 99=17, 99.9=14123007, 99.99=17219583] 
2023-01-17 18:47:50:706 340 sec: 906950 operations; 1663.6 current ops/sec; est completion in 6 minutes [INSERT: Count=16620, Max=16891903, Min=12, Avg=15445.76, 90=14, 99=22, 99.9=79, 99.99=16637951] 
2023-01-17 18:48:00:706 350 sec: 947950 operations; 4100 current ops/sec; est completion in 6 minutes [INSERT: Count=41000, Max=18087935, Min=12, Avg=16710.1, 90=14, 99=22, 99.9=39775, 99.99=17825791] 
2023-01-17 18:48:10:706 360 sec: 965950 operations; 1800 current ops/sec; est completion in 6 minutes [INSERT: Count=18000, Max=17661951, Min=12, Avg=16728.05, 90=14, 99=20, 99.9=40, 99.99=17301503] 
2023-01-17 18:48:20:706 370 sec: 1000950 operations; 3500 current ops/sec; est completion in 6 minutes [INSERT: Count=35000, Max=17465343, Min=12, Avg=16247.06, 90=14, 99=21, 99.9=87, 99.99=17301503] 
2023-01-17 18:48:30:706 380 sec: 1043950 operations; 4300 current ops/sec; est completion in 5 minutes [INSERT: Count=43000, Max=17055743, Min=12, Avg=15768.82, 90=14, 99=18, 99.9=82, 99.99=16490495] 
2023-01-17 18:48:40:706 390 sec: 1056950 operations; 1300 current ops/sec; est completion in 5 minutes [INSERT: Count=13000, Max=18317311, Min=12, Avg=17412.24, 90=14, 99=20, 99.9=44, 99.99=18186239] 
2023-01-17 18:48:50:706 400 sec: 1093950 operations; 3700 current ops/sec; est completion in 5 minutes [INSERT: Count=37000, Max=20742143, Min=12, Avg=19100.77, 90=14, 99=20, 99.9=40927, 99.99=19988479] 
2023-01-17 18:49:00:706 410 sec: 1113950 operations; 2000 current ops/sec; est completion in 5 minutes [INSERT: Count=20000, Max=20316159, Min=12, Avg=18045.34, 90=14, 99=16, 99.9=45, 99.99=19398655] 
2023-01-17 18:49:10:706 420 sec: 1149950 operations; 3600 current ops/sec; est completion in 5 minutes [INSERT: Count=36000, Max=17809407, Min=12, Avg=16690.39, 90=14, 99=20, 99.9=39711, 99.99=17317887] 
2023-01-17 18:49:20:706 430 sec: 1172950 operations; 2300 current ops/sec; est completion in 5 minutes [INSERT: Count=23000, Max=18235391, Min=12, Avg=17453.61, 90=14, 99=21, 99.9=84, 99.99=18202623] 
2023-01-17 18:49:30:706 440 sec: 1201950 operations; 2900 current ops/sec; est completion in 4 minutes [INSERT: Count=29000, Max=19021823, Min=12, Avg=17541.61, 90=14, 99=21, 99.9=185, 99.99=18153471] 
2023-01-17 18:49:40:706 450 sec: 1244950 operations; 4300 current ops/sec; est completion in 4 minutes [INSERT: Count=43000, Max=17842175, Min=12, Avg=15909.66, 90=14, 99=23, 99.9=80, 99.99=16777215] 
2023-01-17 18:49:50:706 460 sec: 1262950 operations; 1800 current ops/sec; est completion in 4 minutes [INSERT: Count=18000, Max=17743871, Min=12, Avg=16395.78, 90=14, 99=16, 99.9=46, 99.99=17055743] 
2023-01-17 18:50:00:706 470 sec: 1295950 operations; 3300 current ops/sec; est completion in 4 minutes [INSERT: Count=33000, Max=19693567, Min=12, Avg=18137.83, 90=14, 99=16, 99.9=51, 99.99=19087359] 
2023-01-17 18:50:10:706 480 sec: 1309950 operations; 1400 current ops/sec; est completion in 4 minutes [INSERT: Count=14000, Max=22003711, Min=12, Avg=20391.12, 90=14, 99=16, 99.9=38, 99.99=21495807] 
2023-01-17 18:50:20:706 490 sec: 1348950 operations; 3900 current ops/sec; est completion in 3 minutes [INSERT: Count=39000, Max=21512191, Min=12, Avg=19197.99, 90=14, 99=22, 99.9=195, 99.99=20398079] 
2023-01-17 18:50:30:706 500 sec: 1373950 operations; 2500 current ops/sec; est completion in 3 minutes [INSERT: Count=25000, Max=18202623, Min=12, Avg=16590.55, 90=14, 99=17, 99.9=40223, 99.99=17367039] 
2023-01-17 18:50:40:706 510 sec: 1400950 operations; 2700 current ops/sec; est completion in 3 minutes [INSERT: Count=27000, Max=18825215, Min=12, Avg=17394.13, 90=14, 99=20, 99.9=54, 99.99=18530303] 
2023-01-17 18:50:50:706 520 sec: 1429950 operations; 2900 current ops/sec; est completion in 3 minutes [INSERT: Count=29000, Max=20217855, Min=12, Avg=18749.7, 90=14, 99=16, 99.9=44, 99.99=19677183] 
2023-01-17 18:51:00:706 530 sec: 1455950 operations; 2600 current ops/sec; est completion in 3 minutes [INSERT: Count=26000, Max=20463615, Min=12, Avg=18108.57, 90=14, 99=22, 99.9=38815, 99.99=19267583] 
2023-01-17 18:51:10:706 540 sec: 1491950 operations; 3600 current ops/sec; est completion in 3 minutes [INSERT: Count=36000, Max=18251775, Min=12, Avg=16174.11, 90=14, 99=21, 99.9=48, 99.99=16809983] 
2023-01-17 18:51:20:706 550 sec: 1507950 operations; 1600 current ops/sec; est completion in 3 minutes [INSERT: Count=16000, Max=19152895, Min=12, Avg=17759.97, 90=14, 99=21, 99.9=96, 99.99=18628607] 
2023-01-17 18:51:30:706 560 sec: 1542950 operations; 3500 current ops/sec; est completion in 2 minutes [INSERT: Count=35000, Max=20758527, Min=12, Avg=19659.31, 90=14, 99=21, 99.9=40031, 99.99=20512767] 
2023-01-17 18:51:40:706 570 sec: 1562950 operations; 2000 current ops/sec; est completion in 2 minutes [INSERT: Count=20000, Max=20430847, Min=12, Avg=18943.81, 90=14, 99=16, 99.9=43, 99.99=20201471] 
2023-01-17 18:51:50:706 580 sec: 1598950 operations; 3600 current ops/sec; est completion in 2 minutes [INSERT: Count=36000, Max=19693567, Min=12, Avg=17650.5, 90=14, 99=17, 99.9=69, 99.99=18415615] 
2023-01-17 18:52:00:706 590 sec: 1614950 operations; 1600 current ops/sec; est completion in 2 minutes [INSERT: Count=16000, Max=19955711, Min=12, Avg=18412.16, 90=14, 99=17, 99.9=39, 99.99=19513343] 
2023-01-17 18:52:10:706 600 sec: 1641950 operations; 2700 current ops/sec; est completion in 2 minutes [INSERT: Count=27000, Max=23183359, Min=12, Avg=21363.43, 90=14, 99=20, 99.9=49, 99.99=22839295] 
2023-01-17 18:52:20:706 610 sec: 1658950 operations; 1700 current ops/sec; est completion in 2 minutes [INSERT: Count=17000, Max=24477695, Min=12, Avg=23196.76, 90=14, 99=16, 99.9=47, 99.99=23838719] 
2023-01-17 18:52:30:706 620 sec: 1696950 operations; 3800 current ops/sec; est completion in 1 minute [INSERT: Count=38000, Max=23314431, Min=12, Avg=20081.91, 90=14, 99=22, 99.9=39775, 99.99=21839871] 
2023-01-17 18:52:40:706 630 sec: 1719950 operations; 2300 current ops/sec; est completion in 1 minute [INSERT: Count=23000, Max=18366463, Min=12, Avg=16985.76, 90=14, 99=22, 99.9=83, 99.99=18087935] 
2023-01-17 18:52:50:706 640 sec: 1751950 operations; 3200 current ops/sec; est completion in 1 minute [INSERT: Count=32000, Max=17743871, Min=12, Avg=16458.05, 90=14, 99=23, 99.9=37055, 99.99=17268735] 
2023-01-17 18:53:00:706 650 sec: 1789950 operations; 3800 current ops/sec; est completion in 1 minute [INSERT: Count=38000, Max=17547263, Min=12, Avg=16394.07, 90=14, 99=21, 99.9=146, 99.99=17104895] 
2023-01-17 18:53:10:706 660 sec: 1809950 operations; 2000 current ops/sec; est completion in 1 minute [INSERT: Count=20000, Max=17989631, Min=12, Avg=16009.53, 90=14, 99=21, 99.9=49, 99.99=16506879] 
2023-01-17 18:53:20:706 670 sec: 1847950 operations; 3800 current ops/sec; est completion in 56 seconds [INSERT: Count=38000, Max=18022399, Min=12, Avg=16206.54, 90=14, 99=17, 99.9=39519, 99.99=17006591] 
2023-01-17 18:53:30:706 680 sec: 1870950 operations; 2300 current ops/sec; est completion in 47 seconds [INSERT: Count=23000, Max=18989055, Min=12, Avg=17695.4, 90=14, 99=21, 99.9=103, 99.99=18694143] 
2023-01-17 18:53:40:734 690 sec: 1900800 operations; 2976.67 current ops/sec; est completion in 37 seconds [INSERT: Count=29858, Max=19054591, Min=12, Avg=17587.41, 90=14, 99=19, 99.9=40959, 99.99=18464767] 
2023-01-17 18:53:50:706 700 sec: 1918950 operations; 1820.1 current ops/sec; est completion in 30 seconds [INSERT: Count=18142, Max=20545535, Min=12, Avg=18531.83, 90=14, 99=17, 99.9=45, 99.99=19431423] 
2023-01-17 18:54:00:706 710 sec: 1945950 operations; 2700 current ops/sec; est completion in 20 seconds [INSERT: Count=27000, Max=24215551, Min=12, Avg=21911.37, 90=14, 99=19, 99.9=66, 99.99=23396351] 
2023-01-17 18:54:10:706 720 sec: 1961950 operations; 1600 current ops/sec; est completion in 14 seconds [INSERT: Count=16000, Max=25149439, Min=12, Avg=23973.48, 90=14, 99=16, 99.9=45, 99.99=24788991] 
2023-01-17 18:54:20:706 730 sec: 1993950 operations; 3200 current ops/sec; est completion in 3 second [INSERT: Count=32000, Max=25657343, Min=12, Avg=22385.84, 90=14, 99=23, 99.9=63, 99.99=23543807] 
2023-01-17 18:54:30:706 740 sec: 1999973 operations; 602.3 current ops/sec; est completion in 1 second [CLEANUP: Count=23, Max=310, Min=52, Avg=87.04, 90=101, 99=310, 99.9=310, 99.99=310] [INSERT: Count=6023, Max=21790719, Min=12, Avg=88249.91, 90=14, 99=22, 99.9=19595263, 99.99=21266431] 
2023-01-17 18:54:32:987 742 sec: 2000000 operations; 11.84 current ops/sec; [CLEANUP: Count=27, Max=69, Min=44, Avg=56.26, 90=67, 99=69, 99.9=69, 99.99=69] [INSERT: Count=27, Max=16793599, Min=8253440, Avg=13718034.96, 90=16179199, 99=16793599, 99.9=16793599, 99.99=16793599] 
[OVERALL], RunTime(ms), 742280
[OVERALL], Throughput(ops/sec), 2694.401034649997
[TOTAL_GCS_PS_Scavenge], Count, 39
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1582
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2131271218408148
[TOTAL_GCS_PS_MarkSweep], Count, 4
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 349
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.047017298054642456
[TOTAL_GCs], Count, 43
[TOTAL_GC_TIME], Time(ms), 1931
[TOTAL_GC_TIME_%], Time(%), 0.2601444198954572
[CLEANUP], Operations, 50
[CLEANUP], AverageLatency(us), 70.42
[CLEANUP], MinLatency(us), 44
[CLEANUP], MaxLatency(us), 310
[CLEANUP], 95thPercentileLatency(us), 101
[CLEANUP], 99thPercentileLatency(us), 310
[INSERT], Operations, 2000000
[INSERT], AverageLatency(us), 18481.170524
[INSERT], MinLatency(us), 12
[INSERT], MaxLatency(us), 32243711
[INSERT], 95thPercentileLatency(us), 15
[INSERT], 99thPercentileLatency(us), 52
[INSERT], Return=OK, 2000
[INSERT], Return=BATCHED_OK, 1998000